app/Controllers/ProductController.php

    public function index()
    {
        $data['product'] = $this->product->findAll();
---
SELECT *
FROM `products`

    public function edit($id){
        //  $this->product->where('product_id', $id);
         $data = $this->product->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '25'